Revit 2026 API

# RebarSpliceByRulesResult Methods

---

The RebarSpliceByRulesResult type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSpliceGeometries | Gets the RebarSpliceGeometry collection which is the result of the splice by rules operation. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

RebarSpliceByRulesResult Class

Autodesk.Revit.DB.Structure Namespace